renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_sdc_sdmem_rx/src/r_sdc_sd_util.c
/**********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer 
*
* Copyright (C) 2014(2015-2017) Renesas Electronics Corporation. All rights reserved.    
**********************************************************************************************************************/
/**********************************************************************************************************************
* System Name  : SDHI Driver
* File Name    : r_sdc_sd_util.c
* Version      : 2.00
* Device       : RX
* Abstract     : API & Sub module
* Tool-Chain   : For RX e2_studio
* OS           : not use
* H/W Platform : RSK board for RX
* Description  : Interface file for SDC SD API for RX
* Limitation   : None
**********************************************************************************************************************/
/**********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              : 05.09.2014 1.00    First Release
*              : 17.07.2015 1.10    Standardized by the combo.
*              : 31.07.2017 2.00    SDHI FIT module separated into hardware low level layer and middleware layer.
*              :                    Changed prefix from SDHI to SDC_SD.
**********************************************************************************************************************/

/**********************************************************************************************************************
Includes <System Includes> , "Project Includes"
**********************************************************************************************************************/
#include "r_sdc_sd_rx_if.h"
#include ".\src\r_sdc_sd_rx_private.h"

#ifdef SDC_SD_CFG_LONGQ_ENABLE
#include "r_longq_if.h"
#endif /* SDC_SD_CFG_LONGQ_ENABLE */

/**********************************************************************************************************************
Macro definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Typedef definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Private global variables and functions
**********************************************************************************************************************/
static uint32_t g_sdc_sd_next = 0;      /* Volume ID Number */

#ifdef SDC_SD_CFG_LONGQ_ENABLE
static longq_hdl_t     p_sdc_sd_long_que = 0;
#endif /* SDC_SD_CFG_LONGQ_ENABLE */

static uint32_t g_sdc_sd_timer_cnt_out[SDC_SD_TIMER_CARD_MAX_NUM][SDC_SD_TIMER_CARD_MAX_COUNT + 1];

/**********************************************************************************************************************
* Outline      : Check Hardware Write Protect
* Function Name: r_sdc_sd_iswp
* Description  : Checks the hardware write protect using the SDHI register.
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : 0                                      ;   WP pin = High (Non Write Protection)
*              : 1                                      ;   WP pin = Low  (Write Protection)
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
uint32_t r_sdc_sd_iswp(uint32_t card_no)
{
    sdc_sd_hndl_t  * p_hndl = 0;
    uint32_t            wp = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    if (SDHI_SUCCESS == R_SDHI_WPLayout(p_hndl->channel))
    {
        /*  Check the SDHI_SDSTS1 WP bit.  */
        R_SDHI_GetWP(p_hndl->channel, &wp);
    }
    else
    {
        wp = 0;
    }

    return wp;
} /* End of function r_sdc_sd_iswp() */

/**********************************************************************************************************************
* Outline      : Get Bit Information
* Function Name: r_sdc_sd_bit_search
* Description  : Checks the bits of argument (data) from LSB.
* Arguments    : uint32_t           data                ;   Checked data
* Return Value : -1                                     ;   no bit has 1'b
*              : other                                  ;   bit number has 1'b
*----------------------------------------------------------------------------------------------------------------------
* Notes        : All 16bits value can be applied.
**********************************************************************************************************************/
int32_t r_sdc_sd_bit_search(uint32_t data)
{
    int32_t i = 0;

    for (i = 15; 0 <= i; i--)
    {
        if (data & 1u)
        {
            return i;
        }
        data >>= SDC_SD_BIT_SHIFT_1;
    }

    return -1;
} /* End of function r_sdc_sd_bit_search() */

/**********************************************************************************************************************
* Outline      : Set Errors Information
* Function Name: r_sdc_sd_set_err
* Description  : Sets the error information (=error) to SD Handle member (=p_hndl->error).
* Arguments    : uint32_t               card_no         ;   SD Card No.
*              : sdc_sd_status_t      error             ;   Error information
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_set_err(uint32_t card_no, sdc_sd_status_t error)
{
    sdc_sd_hndl_t  * p_hndl = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    if (SDC_SD_SUCCESS == p_hndl->error)
    {
        p_hndl->error = error;
    }

