renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_sdc_sdmem_rx/src/r_sdc_sd_util.c
    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_set_err() */

/**********************************************************************************************************************
* Outline      : Get Mode Status
* Function Name: r_sdc_sd_GetModeStatus
* Description  : Gets the mode status.
* Arguments    : uint32_t               card_no         ;   SD Card No.
*              : uint8_t                * p_mode        ;   Mode Status configuration
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_GetModeStatus(uint32_t card_no, uint8_t * p_mode)
{
    sdc_sd_hndl_t * p_hndl = 0;
#if (BSP_CFG_PARAM_CHECKING_ENABLE)
#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO)
    uint8_t         tmp_io_flag = 0;
#endif /* (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO) */
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDC_SD_GET_HNDL(card_no);

#if (BSP_CFG_PARAM_CHECKING_ENABLE)
    if (0 == p_hndl)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;  /* Not initialized */
    }

    /* ---- Check the card is mounted. ---- */
#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM)
    if (SDC_SD_MOUNT_UNLOCKED_CARD != p_hndl->mount)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;
    }
#endif /* (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM) */
#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO)
    tmp_io_flag = p_hndl->io_flag & (SDC_SDIO_FUNC_INIT | SDC_SDIO_POWER_INIT);
    if ((SDC_SDIO_FUNC_INIT | SDC_SDIO_POWER_INIT) != tmp_io_flag)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;
    }
#endif /* (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO) */

    /*  Check the parameter.  */
    if (0 == (uint32_t)p_mode)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;
    }
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

    if (p_hndl->trans_mode & SDC_SD_MODE_DMA)
    {
        *p_mode = SDC_SD_MODE_DMA;
    }
    else if (p_hndl->trans_mode & SDC_SD_MODE_DTC)
    {
        *p_mode = SDC_SD_MODE_DTC;
    }
    else
    {
        *p_mode = SDC_SD_MODE_SW;
    }

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_GetModeStatus() */

/**********************************************************************************************************************
* Outline      : Get Card Status
* Function Name: r_sdc_sd_GetCardStatus
* Description  : Gets the card status.
* Arguments    : uint32_t               card_no         ;   SD Card No.
*              : sdc_sd_card_status_t * p_sdc_sd_card_status    ;   Card Status configuration
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_GetCardStatus(uint32_t card_no, sdc_sd_card_status_t * p_sdc_sd_card_status)
{
    sdc_sd_hndl_t * p_hndl = 0;
#if (BSP_CFG_PARAM_CHECKING_ENABLE)
#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO)
    uint8_t         tmp_io_flag = 0;
#endif /* (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO) */
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDC_SD_GET_HNDL(card_no);

#if (BSP_CFG_PARAM_CHECKING_ENABLE)
    if (0 == p_hndl)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;  /* Not initialized */
    }

#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM)
    if (SDC_SD_MOUNT_UNLOCKED_CARD != p_hndl->mount)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;
    }
#endif /* (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM) */
#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO)
    tmp_io_flag = p_hndl->io_flag & (SDC_SDIO_FUNC_INIT | SDC_SDIO_POWER_INIT);
    if ((SDC_SDIO_FUNC_INIT | SDC_SDIO_POWER_INIT) != tmp_io_flag)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;
    }
#endif /* (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO) */

    /*  Check the parameter.  */
    if (0 == (uint32_t)p_sdc_sd_card_status)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;
    }
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

    p_sdc_sd_card_status->media_type       = p_hndl->media_type;
    p_sdc_sd_card_status->csd_structure    = p_hndl->csd_structure;
    p_sdc_sd_card_status->speed_mode       = p_hndl->speed_mode;
    p_sdc_sd_card_status->io_speed_mode    = p_hndl->io_speed_mode;
    p_sdc_sd_card_status->card_sector_size = p_hndl->card_sector_size;
    p_sdc_sd_card_status->prot_sector_size = p_hndl->prot_sector_size;
    p_sdc_sd_card_status->write_protect    = p_hndl->write_protect;

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_GetCardStatus() */

/**********************************************************************************************************************
* Outline      : Get Card Information
* Function Name: r_sdc_sd_GetCardInfo
* Description  : Gets the card information.
* Arguments    : uint32_t            card_no            ;   SD Card No.
*              : sdc_sd_card_reg_t * p_sdc_sd_card_reg  ;   CardReg configuration
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_GetCardInfo(uint32_t card_no, sdc_sd_card_reg_t * p_sdc_sd_card_reg)
{
    sdc_sd_hndl_t   * p_hndl = 0;
    uint32_t            i = 0;
#if (BSP_CFG_PARAM_CHECKING_ENABLE)
#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO)
    uint8_t         tmp_io_flag = 0;
#endif /* (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO) */
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDC_SD_GET_HNDL(card_no);

#if (BSP_CFG_PARAM_CHECKING_ENABLE)
    if (0 == p_hndl)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;  /* Not initialized */
    }

    /* ---- Check the card is mounted. ---- */
#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM)
    if (SDC_SD_MOUNT_UNLOCKED_CARD != p_hndl->mount)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;
    }
#endif /* (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM) */
#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO)
    tmp_io_flag = p_hndl->io_flag & (SDC_SDIO_FUNC_INIT | SDC_SDIO_POWER_INIT);
    if ((SDC_SDIO_FUNC_INIT | SDC_SDIO_POWER_INIT) != tmp_io_flag)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;
    }
#endif /* (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO) */

    /*  Check the parameter.  */
    if (0 == (uint32_t)p_sdc_sd_card_reg)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_UTIL, __LINE__);
        return SDC_SD_ERR;
    }
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

