renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_sdc_sdmem_rx/src/r_sdc_sd_util.c
    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_GetBuffRegAddress() */

/**********************************************************************************************************************
* Outline      : Get Version
* Function Name: r_sdc_sd_GetVersion
* Description  : Returns the version of this module. The version number is
*                encoded such that the top two bytes are the major version
*                number and the bottom two bytes are the minor version number.
* Arguments    : none
* Return Value : version number
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
uint32_t  r_sdc_sd_GetVersion(void)
{
    uint32_t const version = ((RX_SDHI_VERSION_MAJOR << SDC_SD_BIT_SHIFT_16) | RX_SDHI_VERSION_MINOR);

    return version;
} /* End of function r_sdc_sd_GetVersion() */

#ifdef SDC_SD_CFG_LONGQ_ENABLE                                /* Uses FIT LONGQ module                */
/**********************************************************************************************************************
* Outline      : Get Log HNDL Address
* Function Name: r_sdc_sd_SetLogHdlAddress
* Description  : Gets the Log HNDL Address.
* Arguments    : uint32_t           user_byte_que       ;   user_byte_que
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_SetLogHdlAddress(uint32_t user_long_que)
{
    p_sdc_sd_long_que = (longq_hdl_t)user_long_que;

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_SetLogHdlAddress() */

/**********************************************************************************************************************
* Outline      : Store Debugging Information
* Function Name: r_sdc_sd_log
* Description  : Stores the debugging information.
* Arguments    : uint32_t           flg                 ;   Breakpoint processing
*              : uint32_t           fid                 ;   SDHI driver file No.
*              : uint32_t           line                ;   SDHI driver line No.
* Return Value : 0      ; Successful
*              : 1      ; Error
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
uint32_t r_sdc_sd_log(uint32_t flg, uint32_t fid, uint32_t line)
{
    longq_err_t err = LONGQ_SUCCESS;
    uint32_t    ul_tmp = 0;

    /* Long to Byte */
    ul_tmp = 0;                                                     /* sdhi_log  Reserved */
    ul_tmp = (ul_tmp | (line << SDC_SD_BIT_SHIFT_8));               /* sdhi_log  LINE */
    ul_tmp = (ul_tmp | (fid  << SDC_SD_BIT_SHIFT_21));              /* sdhi_log  FID FILE No. */
    ul_tmp = (ul_tmp | (SDC_SD_DRIVER_ID << SDC_SD_BIT_SHIFT_27));  /* sdhi_log  FID DRIVER No. */
    ul_tmp = (ul_tmp | (flg  << SDC_SD_BIT_SHIFT_31));              /* sdhi_log  Breakpoint processing */

    /* error log white */
    err = R_LONGQ_Put(p_sdc_sd_long_que, ul_tmp);

    if (err != LONGQ_SUCCESS)
    {
        return 1;
    }

    /* Breakpoint processing */
    if (0x80000000 == (ul_tmp & 0x80000000))
    {
        return 1;
    }

    return 0;
} /* End of function r_sdc_sd_log() */
#else
/**********************************************************************************************************************
* Outline      : Get Log HNDL Address
* Function Name: r_sdc_sd_SetLogHdlAddress
* Description  : Gets the Log HNDL Address.
* Arguments    : uint32_t           user_byte_que       ;   user_byte_que
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_SetLogHdlAddress(uint32_t user_long_que)
{
    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_SetLogHdlAddress() */
#endif /* SDC_SD_CFG_LONGQ_ENABLE */

/**********************************************************************************************************************
* Outline      : Store Debugging Information
* Function Name: r_sdc_sd_log
* Description  : Stores the debugging information.
* Arguments    : uint32_t           flg                 ;   Breakpoint processing
*              : uint32_t           fid                 ;   SDHI driver file No.
*              : uint32_t           line                ;   SDHI driver line No.
* Return Value : 0
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
uint32_t r_sdc_sd_Log(uint32_t flg, uint32_t fid, uint32_t line)
{
    SDC_SD_LOG_FUNC(flg, fid, line);
    return 0;
} /* End of function r_sdc_sd_Log() */

/**********************************************************************************************************************
* Outline      : Read from SD Card
* Function Name: r_sdc_sd_read_data
* Description  : Reads the sector data from the data register.
* Arguments    : uint8_t            * p_buff            ;   Read data buffer
*              : uint32_t           reg_addr            ;   Register address
*              : int32_t            num                 ;   Number of data
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_read_data(uint8_t * p_buff, uint32_t reg_addr, int32_t num)
{
    int32_t  i = 0;
    uint32_t * p_reg = (uint32_t *)(reg_addr);
    uint32_t * p_ptr = (uint32_t *)p_buff;
    uint32_t tmp = 0;

